

export const VK_LINK = "https://vk.com/jura_prav";
export const TG_LINK = "https://t.me/jura_prav";
export const EMAIL_REGEX: RegExp =
    /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;

export const THEMES = [
    {id: 1, value: 'Трудовое право'},
    {id: 2, value: 'Семейное право'},
    {id: 3, value: 'Самозанятость и ИП'},
    {id: 4, value: 'Призыв на военную службу'},
    {id: 5, value: 'Защита  прав потребителей'},
    {id: 6, value: 'Ипотека'},
    {id: 7, value: 'Автострахование (ОСАГО, КАСКО)'},
    {id: 8, value: 'Решение жилищных вопросов'},
    {id: 9, value: 'Административная ответственность (штрафы и пр.)'},
]