export const firstRowContent = [
  {
    id: 1,
    width: 455,
    text: "Получить понятный ответ на свой юридический вопрос",
  },
  { id: 2, width: 388, text: "Получить ответ быстро" },
  {
    id: 3,
    width: 468,
    text: "Получить ответ бесплатно или за адекватную стоимость",
  },
];

export const secondRowContent = [
  {
    id: 1,
    width: 455,
    text: "Мы делаем упор на внятное донесение сложной юридической информации до пользователей.",
  },
  {
    id: 2,
    width: 388,
    text: "Наш сервис дает быстрые автоматизированные ответы",
  },
  {
    id: 3,
    width: 468,
    text: "Это сэкономит вам значительную часть средств, которые могли быть потрачены в каком-нибудь юридическом бюро.",
  },
];
