import React from 'react';
import styles from "./terms-of-use.module.scss";

const TermsOfUse: React.FC = () => {
    return (
        <div className={styles.termsofUseWrapper}>
            <div className={styles.container}>
                <section className={styles.termsContent}>
                    <h1 className={styles.termsContent__title}>
                        Соглашение
                        <br />
                        об использовании материалов и сервисов интернет-сайта
                        <br />
                        (пользовательское соглашение)
                    </h1>
                    <div className={styles.address}>
                        <p className={styles.paragraph}>г. Санкт-Петербург</p>
                        <p className={styles.paragraph}>«29» августа 2023 г.</p>
                    </div>
                    <br />
                    <p className={styles.paragraph}>
                        Настоящее Соглашение является публичной офертой и определяет условия использования материалов и сервисов, размещенных на сайте в сети Интернет по адресу: 
                        <span>https://juraprav.ru</span>, посетителями и пользователями данного интернет-сайта (далее - Сайт).
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        1. Термины и определения
                    </p>
                    <br />
                    <p className={styles.paragraph}>
                    Адрес электронной почты — адрес ящика электронной почты посетителя сайта (далее – также Пользователь), указанный и подтвержденный Пользователем в процессе регистрации на Сайте либо в ходе последующего размещения вопросов на Сайте и используемый для идентификации Пользователя Клиента в целях доступа к Сайту и его функционалу.
                    Пользователь – посетитель Сайта, в том чисел, зарегистрированный в качестве Клиента или Юриста посетитель Сайта.
                    Клиент - Пользователь, зарегистрированный на Сайте в качестве «клиента» с целью размещения вопросов (заказов) и поиска исполнителей юридических услуг.
                    Юрист – Пользователь, зарегистрированный на Сайте в качестве «специалиста».
                    Администрация - Общество с ограниченной ответственностью «ЮРА ПРАВ» (ОГРН 1227800156528, ИНН 7838109986), зарегистрированное по адресу: 190031, г. Санкт-Петербург, пр-кт Московский, д. 4, лит. А, пом. 16-н, оф. 3. Администрация является владельцем Сайта.
                    Личный кабинет — часть функционала Сайта, доступ к которому предоставляется после регистрации Пользователя и ввода персонального логина и пароля, которые в дальнейшем обеспечивают доступ к содержимому Личного кабинета. Ввод верных логина и пароля рассматривается как аналог собственноручной подписи Пользователя.
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        2. Общие условия
                    </p>
                    <br />
                    <p className={styles.paragraph}>
                    2.1. Сайт доступен в сети Интернет по адресу <span>https://juraprav.ru</span>, и создан в целях:
                    - Предоставления пользователям доступа к справочной информации по размещенным в открытом доступе на Сайте юридическим вопросам;
                    - Предоставления клиентам возможности размещать заказы на юридические услуги и искать юристов (исполнителей услуг), а юристам находить клиентов и оказывать юридические услуги, в том числе в режиме онлайн (маркетплейс).
                    <br />
                    2.2. Администрация не осуществляет консультирование по юридическим вопросам, не оказывает юридические услуги пользователям и не несет ответственности за качество услуг, оказываемых юристами с помощью Сайта.
                    <br />
                    2.3. Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.
                    <br />
                    2.4. Для получения Клиентом доступа к возможности размещать заказы на юридические услуги и искать юристов (исполнителей услуг) Клиенту необходимо выполнить следующие действия:
                    - заполнить регистрационную форму;
                    - подтвердить действительность адреса электронной почты.
                    <br />
                    2.5. Получая доступ к материалам Сайта, Пользователь считается присоединившимся к настоящему Соглашению, а также условиям всех указанных ниже документов, в полном объеме, без всяких оговорок и исключений (акцепт оферты в соответствие с условиями п. 3 ст. 434, п. 3. ст. 438 ГК РФ)
                    <br />
                    2.6. Неотъемлемыми частями настоящего Соглашения являются:
                    - «Политика конфиденциальности», размещенная в сети Интернет по адресу <span>https://juraprav.ru/terms-of-use.</span>
                    <br />
                    2.7. Настоящее Соглашение может быть изменено и/или дополнено Администрацией в одностороннем порядке без какого-либо специального уведомления. Соглашение является общедоступным документом. Действующая редакция Соглашения располагается в сети Интернет по адресу: <span>https://juraprav.ru/terms-of-use.</span>
                    Новая редакция Соглашения вступает в силу с момента его размещения на Сайте, если иное не предусмотрено новой редакцией.
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        3. Права и обязанности Администрации
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        3.1. Все права на Сайт в целом, на использование сетевого адреса (доменного имени) <span>https://juraprav.ru</span>, на использование знака обслуживания принадлежат Администрации либо третьим лицам. Администрация предоставляет доступ к Сайту всем заинтересованным лицам в соотве тствии с Соглашением и действующим законодательством Российской Федерации.
                        <br />
                        3.2. Администрация предоставляет Пользователям право использования Сайтом с целью поиска необходимой справочной юридической информации с использованием чат-бота. Зарегистрированным Пользователям также предоставляется доступ к Сайту с целью организации взаимодействия между Клиентом и Юристом, в том числе оказания Юристом услуг юридического характера. Администрация имеет право устанавливать размер вознаграждения за предоставление указанного права для различных категорий Пользователей по собственному усмотрению.
                        <br />
                        3.3. Администрация не предоставляет никаких гарантий в отношении безошибочной и бесперебойной работы Сайта или отдельных его компонентов и/или функций, соответствия Сайта конкретным целям и ожиданиям Пользователя, не гарантирует достоверность, точность, полноту и своевременность предоставляемой с его помощью информации, а также не предоставляет никаких иных гарантий, прямо не указанных в Соглашении.
                        <br />
                        3.4. Отношения, возникающие в рамках Соглашения между Администрацией и Юристами, зарегистрированными на Сайте, не являются трудовыми. Администрация не контролирует процесс оказания услуг юридического характера Юристами.
                        Администрация не может рассматриваться как работодатель по отношению к зарегистрированным на сайте Юристам. Соглашение не является публичной офертой на заключение трудовых отношений.
                        <br />
                        3.5. Администрация Сайта не является представителем (агентом) ни Клиентов, ни Специалистов, поэтому не может отвечать ни за какие финансовые обязательства, возникающие между теми и другими.
                        <br />
                        Администрация Сайта не несет ответственности за посещение и использование им внешних ресурсов, ссылки на которые могут содержаться на Сайте.
                        3.6. Юрист, зарегистрированный на Сайте, самостоятельно и независимо определяет стоимость оказываемых Клиентам услуг и соглашается с оплатой в пользу Администрации Сайта фиксированной части от суммы оказанных Клиентам услуг. Размер этой части определяется в процентном отношении и устанавливается индивидуально для каждого Юриста при регистрации.
                        Оплата юристом права на использование Сайта производится в автоматическом режиме в форме удержания соответствующей суммы из стоимости юридических услуг, оказанных Юристом.
                        <br />
                        3.7. Администрация Сайта не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой регистрации, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.
                        <br />
                        3.8. Пользователь согласен с тем, что Администрация Сайта не несет какой-либо ответственности и не имеет каких либо обязательств в связи с рекламой, которая может быть размещена на Сайте.
                        <br />
                        3.9. Администрация не несет ответственности за какие либо прямые или косвенные убытки, возникшие в результате использования или невозможности использования Сайта и/или ущерб, причиненный Пользователю и/или третьим лицам в результате использования, неиспользования или невозможности использования Сайта или отдельных его компонентов и/или функций, в том числе из-за возможных ошибок или сбоев в работе Сайта, за исключением случаев, прямо предусмотренных законодательством.
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        4. Обязательства Пользователя
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        4.1. Пользователь соглашается не предпринимать действий и не оставлять комментарии, записи и вопросы, которые могут рассматриваться как нарушающие российское законодательство или нормы международного права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных прав, общепринятые нормы морали и нравственности, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и сервисов Сайта.
                        <br />
                        4.2. Использование материалов Сайта без согласия правообладателей не допускается.
                        <br />
                        4.3. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна.
                        <br />
                        4.4. Используя Сайт, Пользователь подтверждает свое согласие с тем, что ему может быть предоставлена информация по заданному им вопросу в автоматическом режиме с использованием чат-бота. Текст, являющийся результатом работы чат-бота, носит информационный характер и не является результатом оказания услуг юридического характера.
                        <br />
                        4.5. Никакие положения Соглашения не предоставляют Пользователю права на использование фирменного наименования, коммерческого обозначения, товарных знаков, доменных имен и иных отличительных знаков (результатов интеллектуальной деятельности) Администрации. Право на использование фирменного наименования, коммерческого обозначения, товарных знаков, доменных имен и иных отличительных знаков (результатов интеллектуальной деятельности) Администрации может быть предоставлено исключительно по письменному соглашению с Администрацией.
                        <br />
                        4.6. Принимая настоящее Соглашение путем регистрации на Сайте или использования его материалов и функционала, Пользователь подтверждает свое согласие на обработку Администрацией его персональных данных, предоставленных при пользовании Сайтом. Обработка персональных данных Пользователя осуществляется в соответствии с законодательством Российской Федерации в порядке, указанном в «Политике обработки персональных данных», размещенной в сети Интернет по адресу <span>https://juraprav.ru/terms-of-use.</span>
                        <br />
                        4.7. Контент и его составляющие, являются объектами исключительных прав Администрации, Пользователей и других правообладателей, за исключением случаев, когда объекты контента не являются объектами исключительных прав.
                        <br />
                        4.8. Кроме случаев, установленных настоящим Соглашением, а также действующим законодательством Российской Федерации, никакой контент не может быть скопирован (воспроизведен), переработан, распространен, отображен во фрейме, опубликован, скачан, передан, продан или иным способом использован целиком или по частям без предварительного разрешения правообладателя, кроме случаев, когда правообладатель явным образом выразил свое согласие на свободное использование контента любым лицом.
                        <br />
                        4.9. Пользователь, размещая на Сайте принадлежащий ему на законных основаниях контент (в том числе, но не ограничиваясь, тексты юридических вопросов, юридических консультаций, договоров), предоставляет другим пользователям неисключительную лицензию на использование путем просмотра, воспроизведения (в том числе копирования), переработку (в том числе на распечатку копий) исключительно с целью личного некоммерческого использования, кроме случаев, когда такое использование причиняет или может причинить вред охраняемым законом интересам правообладателя.
                        <br />
                        4.10. Использование Пользователем контента, доступ к которому получен исключительно для личного некоммерческого использования, допускается при условии сохранения всех знаков авторства (копирайтов) или других уведомлений об авторстве, сохранения имени автора в неизменном виде, сохранении произведения в неизменном виде и отметки об источнике размещения контента в виде записи «juraprav.ru», размещенной в любой части контента.
                        <br />
                        4.11. Кроме контента права на который принадлежат Пользователю, последний не вправе загружать или иным образом доводить до всеобщего сведения (публиковать на Сайте) контент других сайтов, баз данных и прочие результаты интеллектуальной деятельности при отсутствии явным образом выраженного согласия правообладателя на такие действия.
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        5. Заключительные положения
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        5.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).
                        <br />
                        5.2. Получатель претензии в течение 30 календарных дней со дня получения претензии письменно уведомляет заявителя претензии о результатах рассмотрения претензии.
                        <br />
                        5.3. При недостижении согласия споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат разрешению в Арбитражном суде г. Санкт-Петербурга и Ленинградской области, если это не противоречит действующему законодательству Российской Федерации.
                        <br />
                        5.4. Признание судом какого-либо положения Соглашения недействительным или не подлежащим принудительному исполнению не влечет недействительности иных положений Соглашения.
                        <br />
                        5.5. Обращения, предложения, претензии и иные запросы физических и юридических лиц к Администрации Сайта, связанные с Соглашением или работой Сайта, а также запросы уполномоченных государственных органов могут быть направлены на электронный адрес: <span>support@juraprav.ru</span>.
                        <br />
                        5.6. Бездействие со стороны Администрации Сайта в случае нарушения кем-либо из Пользователей положений Соглашения не лишает Администрацию Сайта права предпринять позднее соответствующие действия в защиту своих интересов и защиту авторских прав на охраняемые в соответствии с законодательством материалы Сайта, которые могут выражаться в блокировании, изменении и удалении учетных записей Пользователей и/или иной информации, размещенной Пользователями в нарушение настоящего Соглашения и законодательства Российской Федерации.
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                        Данные Администрации
                    </p>

                    <br />

                    <p className={styles.paragraph}>
                    Общество с ограниченной ответственностью «ЮРА ПРАВ»
                    <br />
                    ИНН 7838109986
                    <br />
                    КПП 783801001
                    <br />
                    ОГРН 1227800156528
                    <br />
                    Контактная информация:
                    <br />
                    Юридический адрес:
                    <br />
                    г. Санкт-Петербург, вн. тер. г. муниципальный округ сенной округ, пр-кт Московский, д. 4, лит. а, пом. 16-н, оф. 3
                    Почтовый адрес:
                    <br />
                    190005, г. Санкт-Петербург, вн. тер. г. муниципальный округ сенной округ, пр-кт Московский, д. 4, лит. а, пом. 16-н, оф. 3
                    Адрес электронной почты: <span>info@juraprav.ru</span>.
                    </p>
                </section>
            </div>
        </div>
    )
}

export default TermsOfUse;